#+title: Lisp Core Images

** First, a bit of Lisp

- As the name suggests, Common Lisp is a Lisp

#+begin_src lisp
(print "Hello world!")
#+end_src

#+begin_src lisp
(= 1 1)
#+end_src

#+begin_src lisp
(if (= 0 1)
    "True"
    "Not True")
#+end_src

#+RESULTS:
: Not True

** Writing a basic program and function

- Let's create a bad function

  #+begin_src lisp
  (defun divide-by-zero (n)
    (/ n 0))
  #+end_src

  #+RESULTS:
  : DIVIDE-BY-ZERO

- Let's try to call it and see what happens
  
   #+begin_src lisp
   (divide-by-zero 1)
   #+end_src

 #+RESULTS:
 : You should not divide by zero

- Lisp also can't divide by zero. This is a clear error. We don't exit
  the REPL, but it's undesired behaviour. Let's handle the error a bit
  better.

  #+begin_src lisp
  (defun divide-by-zero (n)
    (handler-case 
     (/ n 0)
      (error (c)
	(print "You should not divide by zero")))) 
  #+end_src

  #+RESULTS:
  : DIVIDE-BY-ZERO

*** Dividing by zero again

We can do the same thing we did last time!
#+begin_src shell
./calc / 1 0
#+end_src

#+RESULTS:
: debugger invoked on a DIVISION-BY-ZERO @700307E02C in thread
: #<THREAD "main thread" RUNNING {7005520003}>:
:   arithmetic error DIVISION-BY-ZERO signalled
: Operation was (/ 1 0).
:
: Type HELP for debugger help, or (SB-EXT:EXIT) to exit from SBCL.
:
: restarts (invokable by number or by possibly-abbreviated name):
:   0: [ABORT] Exit from the current thread.
:
: (SB-KERNEL::INTEGER-/-INTEGER 1 0)

- This is a more "real life" example. When we get an exception that is
  not caught, we end the application execution. Usually, we are able
  to check what's going on by reading the log, which is possible here.

  However, Common Lisp gives us another option! We can grab the
  execution and redo the error!

  First, let's try to catch this exception.

  #+begin_src lisp

  (defun main ()
    (let* ((args sb-ext:*posix-argv*)
	   (form (rest (read-from-string (format nil "~&(~{~A~^ ~})~%" args)))))
      (print (handler-case (eval form)
	       (error ()
		 (format t "Error! ~&"))))))

  (sb-ext:save-lisp-and-die "calc"
    :executable t
    :toplevel 'main)

  #+end_src

  Cool. Now, if we perform any invalid operation, *handler-case* will
  swallow it and we will spit an error.

  #+begin_src shell
  ./calc / 1 0
  > Error! 
  #+end_src

- Not very compelling. Also, it really doesnt'really help us, in fact, it's worse.
  However, as said before, we can use *save-lisp-and-die* to do some cool tricks.

  We kind of know what's going on here, We know that we are going to
  evaluate a form of Common Lisp and want to see some results. What if
  we saved the form that it's going to be evaluated?

  #+begin_src lisp
  (defvar *ERRORS*)

  (defun main ()
    (let* ((args sb-ext:*posix-argv*)
	   (form (rest (read-from-string (format nil "~&(~{~A~^ ~})~%" args)))))
      (print (handler-case (eval form)
	       (error ()
		 (format t "Error! ~&")
		 (setf *ERRORS* form)
		 (sb-ext:save-lisp-and-die "calc-error"))))))

  (sb-ext:save-lisp-and-die "calc"
    :executable t
    :toplevel 'main)
  #+end_src

  Creating our executable and running it will not yield a different
  result:

  #+begin_src shell
  ./calc / 1 0
  > Error! 
  #+end_src

  However, we can see that the code is a bit different:

  - *let** is actually just a way to bind the symbols one after the other.
  - *defvar* creates a variable that we called *ERRORS*.
  - *(setf *ERRORS* form)* sets the value of our to-be evaluated form
    to the *ERRORS* variable.
  - And, if we get an error, we create a core file named "calc-error".
    We can load this file and look at the variable.
    #+begin_src shell
    sbcl --core calc-error
    > *ERRORS*
    > (/ 1 0)
    #+end_src

    With this, it's easy to see what was the error.

